In [2]:
import numpy as np
import pandas as pd

In [82]:
df = pd.read_csv("train_data.csv")

In [64]:
df.head()

  CategoryCode  ItemCode     DateID  DailySales
0   category_2    117610 2021-10-30           7
1   category_4    836584 2021-11-11          16
2   category_1    370195 2022-01-17           6
3   category_2    172582 2021-10-23           5
4   category_2   1006009 2021-10-23           5

In [83]:
df['DateID'] = pd.to_datetime(df['DateID']) - pd.to_timedelta(7, unit='d')
#df_new = df.groupby(['ItemCode', pd.Grouper(key='DateID', freq='W-MON')])['DailySales'].sum().reset_index().sort_values('DateID')

In [76]:
df.head(10)

  CategoryCode  ItemCode     DateID  DailySales  week
0   category_2    117610 2021-10-30           7    43
1   category_4    836584 2021-11-11          16    45
2   category_1    370195 2022-01-17           6     3
3   category_2    172582 2021-10-23           5    42
4   category_2   1006009 2021-10-23           5    42
5   category_2    903976 2021-12-30           1    52
6   category_1    145978 2021-10-23           3    42
7   category_1   1061341 2022-01-17           5     3
8   category_1    371239 2021-12-29           1    52
9   category_2    865933 2022-02-01           3     5

In [25]:
df.isnull().sum()

ItemCode      0
DateID        0
DailySales    0
dtype: int64

In [84]:
df['week'] = pd.to_datetime(df['DateID']).dt.week

C:\Users\NISHAD~1\AppData\Local\Temp/ipykernel_15632/1792957466.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  df['week'] = pd.to_datetime(df['DateID']).dt.week

In [85]:
def find_week(week):
    if week%4==1:
        return "w1"
    elif week%4 == 2:
        return "w2"
    elif week%4 == 3:
        return "w3"
    else:
        return "w4"

In [86]:
df['week_name'] = df['week'].apply(lambda x:find_week(x))

In [103]:
df.head(10)

  CategoryCode  ItemCode     DateID  DailySales  week week_name
0   category_2    117610 2021-10-30           7    43        w3
1   category_4    836584 2021-11-11          16    45        w1
2   category_1    370195 2022-01-17           6     3        w3
3   category_2    172582 2021-10-23           5    42        w2
4   category_2   1006009 2021-10-23           5    42        w2
5   category_2    903976 2021-12-30           1    52        w4
6   category_1    145978 2021-10-23           3    42        w2
7   category_1   1061341 2022-01-17           5     3        w3
8   category_1    371239 2021-12-29           1    52        w4
9   category_2    865933 2022-02-01           3     5        w1

In [104]:
df_week = df.drop(['DateID','week'], axis = 1,)

In [105]:
df_week.head()

  CategoryCode  ItemCode  DailySales week_name
0   category_2    117610           7        w3
1   category_4    836584          16        w1
2   category_1    370195           6        w3
3   category_2    172582           5        w2
4   category_2   1006009           5        w2

In [106]:
gk = df_week.groupby('week_name')


gk.head(10)

   CategoryCode  ItemCode  DailySales week_name
0    category_2    117610           7        w3
1    category_4    836584          16        w1
2    category_1    370195           6        w3
3    category_2    172582           5        w2
4    category_2   1006009           5        w2
5    category_2    903976           1        w4
6    category_1    145978           3        w2
7    category_1   1061341           5        w3
8    category_1    371239           1        w4
9    category_2    865933           3        w1
10   category_3   1081087           1        w4
11   category_1   1061341           8        w4
12   category_1   1032550           1        w2
13   category_2   1090249           3        w1
14   category_3    169504         120        w4
15   category_2   1067092           8        w3
16   category_1   1054978           7        w1
17   category_1   1050046           3        w2
18   category_1   1044610           2        w4
19   category_2    138742           9        w1
20   category_2    815101           4        w3
21   category_1     59047           2        w4
22   category_2     39436           2        w4
23   category_1    379249          13        w3
24   category_1   1048975           2        w4
25   category_2    213802           1        w4
27   category_1    371239           4        w1
29   category_2   1103056           3        w1
30   category_2    836125          13        w1
33   category_3    131983           8        w1
34   category_2   1098493           2        w1
39   category_2   1076938           7        w3
43   category_2    172033          28        w3
44   category_3   1090024           3        w2
46   category_2   1067074           4        w3
49   category_2   1071106           1        w3
57   category_3   1101661          11        w2
68   category_2   1044502           1        w2
69   category_2    838456           6        w2
78   category_2   1090240           1        w2

In [100]:
df.head()

  CategoryCode  ItemCode     DateID  DailySales  week week_name
0   category_2    117610 2021-10-30           7    43        w3
1   category_4    836584 2021-11-11          16    45        w1
2   category_1    370195 2022-01-17           6     3        w3
3   category_2    172582 2021-10-23           5    42        w2
4   category_2   1006009 2021-10-23           5    42        w2

In [101]:
gkk = df.groupby(['CategoryCode'])

In [102]:
gkk.head()

   CategoryCode  ItemCode     DateID  DailySales  week week_name
0    category_2    117610 2021-10-30           7    43        w3
1    category_4    836584 2021-11-11          16    45        w1
2    category_1    370195 2022-01-17           6     3        w3
3    category_2    172582 2021-10-23           5    42        w2
4    category_2   1006009 2021-10-23           5    42        w2
5    category_2    903976 2021-12-30           1    52        w4
6    category_1    145978 2021-10-23           3    42        w2
7    category_1   1061341 2022-01-17           5     3        w3
8    category_1    371239 2021-12-29           1    52        w4
9    category_2    865933 2022-02-01           3     5        w1
10   category_3   1081087 2021-12-28           1    52        w4
11   category_1   1061341 2021-11-30           8    48        w4
14   category_3    169504 2021-12-29         120    52        w4
28   category_4   1060909 2021-11-30          39    48        w4
31   category_4   1060909 2021-12-29          11    52        w4
33   category_3    131983 2021-11-10           8    45        w1
42   category_4   1060909 2021-10-16          16    41        w1
44   category_3   1090024 2021-10-23           3    42        w2
45   category_3    169504 2021-12-28         109    52        w4
62   category_4   1003192 2022-02-02          11     5        w1

In [117]:
new_column = df_week.groupby(['week_name','CategoryCode','ItemCode'])['DailySales'].mean()

In [122]:
df_week.set_index(["week_name", "CategoryCode","ItemCode"], inplace = True,append = True, drop = True)

In [133]:
df_week["weeklySales"] =df_week['DailySales'].mean()

In [134]:
df_week.head(10)

                                   DailySales  weeklySales
  week_name CategoryCode ItemCode
0 w3        category_2   117610             7      7.35189
1 w1        category_4   836584            16      7.35189
2 w3        category_1   370195             6      7.35189
3 w2        category_2   172582             5      7.35189
4 w2        category_2   1006009            5      7.35189
5 w4        category_2   903976             1      7.35189
6 w2        category_1   145978             3      7.35189
7 w3        category_1   1061341            5      7.35189
8 w4        category_1   371239             1      7.35189
9 w1        category_2   865933             3      7.35189

In [141]:
clean_data = new_column.to_frame()

In [145]:
clean_data.head()

                                 DailySales  weeklySales
week_name CategoryCode ItemCode
w1        category_1   3418       10.000000           10
                       3427        6.424242            7
                       17287       3.166667            4
                       17296      63.400000           64
                       24136       6.437500            7

In [144]:
import math

clean_data['weeklySales'] = clean_data['DailySales'].apply(lambda x:math.ceil(x))

In [146]:
final_df = clean_data.drop(['DailySales'], axis = 1,)

In [147]:
final_df.head()

                                 weeklySales
week_name CategoryCode ItemCode
w1        category_1   3418               10
                       3427                7
                       17287               4
                       17296              64
                       24136               7